Что покажет приведённый ниже код?

print("I'm", 'Just', 'Ken', "!")

I'm Just Ken !



Что покажет приведённый ниже код?

print('Hello, it's me!')

Если у нас строка обрамляется одинарными кавычками, то мы не можем использовать одинарную кавычку внутри этой строки, это приводит к ошибке SyntaxError. 🤯



Что покажет приведённый ниже код?

print(Перт, -, столица, штата, Западная, Австралия)

Для отображения текста с помощью команды print() в Python необходимо всегда помещать этот текст внутрь кавычек. 😎



Напишите программу, которая выводит на экран следующий текст:

Здравствуй, мир!

print('Здравствуй, мир!')



В популярном сериале «Остаться в живых» использовалась последовательность чисел «4 8 15 16 23 42», которая принесла героям удачу и помогла сорвать джекпот в лотерее. Напишите программу, которая выводит данную последовательность чисел с одним пробелом между ними.

Примечание. В чистом виде текст '4 8 15 16 23 42' нельзя использовать. Вместо этого воспользуйтесь возможностью команды print() выводить несколько аргументов, указанных через запятую.

print('4', '8', '15', '16', '23', '42')



Измените предыдущую программу так, чтобы каждое число последовательности 

4 8 15 16 23 42 печаталось на отдельной строке.

Примечание. Каждая последующая команда print() выводит указанный текст, начиная с новой строки.

print('4')
print('8')
print('15')
print('16')
print('23')
print('42')



Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):

*
**
***
****
*****
******
*******



Команда input() используется для

считывания данных с клавиатуры



Что покажет приведённый ниже код?
a = input()
b = input()
c = input()
print(a, b, c)
если на вход программе будут поданы строки:
Perm
Moscow
Chelyabinsk

Perm Moscow Chelyabinsk



Что покажет приведённый ниже код?
a = "Don't worry"
b = 'Be happy'
print('a')
print('b')

a
b



Что покажет приведённый ниже код?
a = 'Leave me alone'
b = "I'm coding"
print(a)
print(b)

Leave me alone
I'm coding



Установите порядок действий при выполнении следующего кода:
print('Какой язык программирования ты изучаешь?')
language = input()
print(language, '- отличный выбор!')

Вывод текста "Какой язык программирования ты изучаешь?"
Ввод данных (пользователь вводит текст)
Нажатие клавиши Enter
Запись введенного текста в переменную language
Вывод значения переменной language и через пробел текста "- отличный выбор!"



Что покажет приведённый ниже код?
a = '10'
b = '20'
c = '30'
print(a b c)

произойдёт ошибка. Если вы указываете несколько аргументов в команде print(), их надо отделять запятыми. 🥱



Какие из имён допустимы для названия переменных в Python?

Имя переменной может содержать буквы, цифры и символ нижнего подчеркивания (_). 😇
Имя переменной не может начинаться с цифры. 😇
Имя переменной не может содержать пробелы. 😇

teacher_2
teacher2
teacher




На вход программе подаётся строка текста – имя человека. Напишите программу, которая принимает эту строку текста через стандартный поток ввода (команда input()). Далее программа должна выводить на экран приветствие в следующем формате:
Привет, <имя человека>
где <имя человека> – строка текста, которую ваша программа приняла на вход.
Формат входных данных
На вход программе подаётся одна строка — имя человека.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

name = input()
print("Привет," , name)



На вход программе подается строка текста – название футбольной команды. Напишите программу, которая принимает через стандартный поток ввода (команда input()) эту строку и печатает предложение в следующем формате:
<название футбольной команды> - чемпион!
где <название футбольной команды> – строка текста, которую ваша программа приняла на вход.
Формат входных данных
На вход программе подается название футбольной команды.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи

name = input()
print( name, '- чемпион!')



Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в той же последовательности, каждую на отдельной строке.
Формат входных данных
На вход программе подаются три строки, каждая на отдельной строчке.
Формат выходных данных
Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.

name1= input()
name2= input()
name3= input()
print(name1)
print(name2)
print(name3)



Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в обратной последовательности, каждую на отдельной строчке.
Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.
Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

name1= input()
name2= input()
name3= input()
print(name3)
print(name2)
print(name1)
